export const allEventsColumn = []
export const eventColumn = []

export const fakeEventColumn = []
export const fakeEvent = []
export const fakeSuperviser = []

export const fakeGroup = []

export const fakeAllEvent = [
    { "id": 1, "name": "Смирнов Владимир Олегович", "2132": 1, "1132": 0, "112": 1, '1234': 1, '431': 0 },
    { "id": 1, "name": "Смирнов Владимир Олегович", "2132": 1, "1132": 0, "112": 1, '1234': 1, '431': 1 },
    { "id": 2, "name": "Симакина Анна Анатольевна", "2132": 0, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 3, "name": "Петров Михаил Васильевич", "2132": 1, "1132": 1, "112": 0, '1234': 1, '431': 0 },
    { "id": 3, "name": "Петров Михаил Васильевич", "2132": 1, "1132": 1, "112": 0, '1234': 1, '431': 1 },
    { "id": 4, "name": "Иванова Людмила Николаевна", "2132": 0, "1132": 0, "112": 1, '1234': 1, '431': 0 },
    { "id": 5, "name": "Соловьев Александр Иванович", "2132": 1, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 6, "name": "Белкина Марина Сергеевна", "2132": 0, "1132": 1, "112": 0, '1234': 1, '431': 0 },
    { "id": 7, "name": "Егоров Владислав Евгеньевич", "2132": 1, "1132": 0, "112": 1, '1234': 1, '431': 0 },
    { "id": 8, "name": "Кузнецова Оксана Александровна", "2132": 0, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 9, "name": "Семенов Константин Георгиевич", "2132": 1, "1132": 0, "112": 0, '1234': 1, '431': 0 },
    { "id": 10, "name": "Дементьева Татьяна Павловна", "2132": 0, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 11, "name": "Борисов Игорь Алексеевич", "2132": 1, "1132": 1, "112": 0, '1234': 1, '431': 0 },
    { "id": 12, "name": "Павлова Дарья Дмитриевна", "2132": 0, "1132": 0, "112": 1, '1234': 1, '431': 0 },
    { "id": 13, "name": "Миронов Николай Михайлович", "2132": 1, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 14, "name": "Корнилова Галина Васильевна", "2132": 0, "1132": 1, "112": 0, '1234': 1, '431': 0 },
    { "id": 15, "name": "Андреев Леонид Павлович", "2132": 1, "1132": 0, "112": 1, '1234': 1, '431': 0 },
    { "id": 16, "name": "Хохлова Надежда Сергеевна", "2132": 0, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 17, "name": "Фролов Юрий Геннадьевич", "2132": 1, "1132": 0, "112": 0, '1234': 1, '431': 0 },
    { "id": 18, "name": "Игнатова Валентина Ивановна", "2132": 0, "1132": 1, "112": 1, '1234': 1, '431': 0 },
    { "id": 19, "name": "Чернова Лариса Викторовна", "2132": 1, "1132": 1, "112": 0, '1234': 1, '431': 0 },
    { "id": 20, "name": "Медведев Роман Валерьевич", "2132": 0, "1132": 0, "112": 0, '1234': 1, '431': 0 }
]


export const fakeAllEventColumn = [
    {
        accessorKey: 'name',
        header: "ФИО",
    },
    {
        accessorKey: '2132',
        header: "Турнир по футболу среди любителей"
    },
    {
        accessorKey: '1132',
        header: "Международный экономический форум"
    },
    {
        accessorKey: '112',
        header: "Конференция по искусственному интеллекту"
    },
    {
        accessorKey: '1234',
        header: "Конференция по искусственному интеллекту"
    },
    {
        accessorKey: '431',
        header: "Конференция по искусственному интеллекту"
    },
]

export const fakeDepartment = []